// Описание:
// Нам нужна функция, которая может преобразовать строку в число. Какие способы достижения этой цели вы знаете?

// Примечание. 
// Не волнуйтесь, все входные данные будут строками, и каждая строка является совершенно допустимым представлением целого числа.

// Примеры:
// "1234" --> 1234
// "605"  --> 605
// "1405" --> 1405
// "-7" --> -7

const stringToNumber = function (str) {
    return Number(str);
}
// console.log(stringToNumber("1234"))
// console.log(stringToNumber("605"))
// console.log(stringToNumber("1405"))
// console.log(stringToNumber("-7"))
