// Элемент массива является доминирующим, если он больше, чем все элементы справа от него. Вам будет предоставлен массив, 
// и вашей задачей будет вернуть список всех доминирующих элементов. Например:

// solve([1,21,4,7,5]) = [21,7,5]       потому что 21, 7 и 5 больше, чем элементы справа от них.
// solve([5,4,3,2,1]) = [5,4,3,2,1]
// Обратите внимание, что последний элемент всегда включен. Все числа будут больше 0.


function solve(arr) {

}




console.log(solve([16, 17, 14, 3, 14, 5, 2]));                   // [17, 14, 5, 2]
// console.log(solve([92, 52, 93, 31, 89, 87, 77, 105]));           // [105]
// console.log(solve([75, 47, 42, 56, 13, 55]));                    // [75, 56, 55]
// console.log(solve([67, 54, 27, 85, 66, 88, 31, 24, 49]));        // [88, 49]
// console.log(solve([76, 17, 25, 36, 29]));                        // [76, 36, 29]
// console.log(solve([104, 18, 37, 9, 36, 47, 28]));                // [104, 47, 28]
